<template>
  <div class="privacy-shell">
    <header>
      <router-link to="/setting">
        <vantIcon name="arrow-left" />
      </router-link>
      <span>隐私政策</span>
    </header>
    <p></p>
    <p>更新日期：2021年5月8日</p>
    <p>生效日期：2021年5月8日</p>
    <p style="font-weight: 700">提示</p>
    <p style="font-weight: 700">
      本隐私政策适用于上海佰集信息科技有限公司（以下简称我公司）提供的简书的产品及服务。本隐私政策中简书的客户端软件可能会涉及不同应用版本，用户需选择与所安装手机相匹配的软件版本，不同版本的简书所提供的功能和服务可能有所不同。
      我公司深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我公司致力于维持您对我公司的信任，恪守以下原则保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我公司承诺，我公司将按业界成熟的安全标准采取相应的安全保护措施来保护您的个人信息。
      为了更好的保护您的个人信息，建议您仔细阅读更新后的隐私政策。如您对本隐私政策条款有任何异议或疑问，您可通过本隐私政策第九条公布的联系方式与我公司联系。
    </p>

    <h3>目录</h3>
    <p>一、我公司如何收集和使用您的个人信息</p>
    <p>二、我公司如何使用Cookie和同类技术</p>
    <p>三、我公司如何共享、转让、公开披露您的个人信息</p>
    <p>四、我公司如何保护您的个人信息</p>
    <p>五、您的权利</p>
    <p>六、我公司如何处理儿童的个人信息</p>
    <p>七、您的个人信息如何在全球范围转移</p>
    <p>八、本隐私政策如何更新</p>
    <p>九、如何联系我公司</p>
    <p>十、争议解决</p>

    <h3>一、我公司如何收集和使用您的个人信息</h3>
    <h4>1、个人信息和个人敏感信息定义</h4>
    <p>
      个人信息，指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。我公司实际具体收集的个人信息种类以下文描述为准。
      个人敏感信息，指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。我公司实际具体收集的个人敏感信息种类以下文描述为准。
    </p>

    <h4>2、我公司如何收集和使用您的个人信息</h4>
    <h5>（1）登录简书</h5>
    <p>
      您创建并登录简书时，您需提供您的手机号及电子邮箱，创建的用户名和密码。如果不创建账号，并不会影响您使用简书搜索浏览功能，但会影响您发表评论等附加业务功能。
      您也可以使用第三方帐号微信、QQ、新浪微博登录简书。如您使用微信登录，我公司会收集您的微信头像、昵称、地区和性别，该信息作为您在简书的用户头像、昵称使用；如您使用QQ登录，我公司会收集您的QQ头像、昵称、地区和性别，该信息作为您在简书的用户头像、昵称使用；如您使用新浪微博登录，我公司会收集您的头像、昵称及性别，该信息作为您在简书的用户头像、昵称使用。如您拒绝授权前述信息，您将无法使用第三方平台账号登录简书及发表评论，但并不会影响您使用简书搜索浏览等功能。
    </p>

    <h5>（2）发布内容</h5>
    <p>
      当您使用发布内容等需身份认证的功能或服务时，您需要提供你的真实身份信息（真实姓名、身份证号码、电话号码等）以完成实名验证。如您不提供这些信息，您将不能发布任何内容，但您可以继续使用“简书”的其他服务
    </p>
    <h5>（3）个性化推荐</h5>
    <p>
      为了向您进行个性化文章以及个性化广告的推荐、为您推荐更适合的定制化服务，我公司会向您收集阅读兴趣偏好、搜索关键字词记录、阅读记录、阅读时长、点击数据等及您的设备标识信息【本隐私政策的“设备标识信息”包括硬件型号、操作系统版本号/类型、唯一设备识别码（
      IMEI/Android ID/IDFA/OpenUDID/GUID/SIM 卡 IMSI
      信息等）、设备MAC地址、IP地址、软件版本号、网络接入方式及类型)】。当您开启设备定位功能，我公司还会向您收集地理位置信息，包括精准定位信息。您可以通过系统设置关闭定位功能的授权，以停止我公司收集您的位置信息，但这可能会导致无法达到相关服务预期达到的使用效果。
    </p>
    <h5>（4）手机诊断</h5>
    <p>
      当您使用手机诊断功能时，我公司会收集您的手机品牌，手机型号，android系统版本，设备唯一设备识别码，网络状态，屏幕尺寸，内存占用，APP用户信息，运营商，IP地址，DNS服务器地址，用于您的手机简书错误信息收集及bug诊断。
    </p>
    <h5>（5）手机通讯录</h5>
    <p>
      当您使用“通讯录”添加好友页面，我公司会收集您手机通讯录信息，您可以邀请用户通讯录好友，提高简书社交性。
    </p>
    <h5>（6）产品适配</h5>
    <p>
      为了简书产品可以适配您的设备，我公司会向您收集唯一设备标识别码、操作系统名称和版本。
    </p>
    <h5>（7）认证</h5>
    <p>
      ①您在使用身份实名认证的功能或服务时，根据相关法律法规，您可能需要提供您的真实身份信息（真实姓名、身份证号码、电话号码、身份证件）以完成实名验证，特别且必要情况下基于安全考虑，为了确保我公司为您本人提供服务，我公司可能会根据您提供的信息进行校验，将通过“人脸识别”的方式验证您的身份。该信息属于个人敏感信息，您可以拒绝提供，但您将可能无法获得相关服务，但不影响其他功能与服务的正常使用。
    </p>

    <p>
      ②如您将您在简书发布文章的著作权（授权性质为专有使用权）及转授权授权予我公司，则：我公司在转授权下游版权方行使授权文章的著作权时，为证明我公司享有授权文章的著作权及转授权，下游版权方可能会要求我公司提供您的身份证复印件；如第三方侵权使用您的文章，我公司维权时，司法机关及侵权方可能会要求我公司提供您的身份证复印件。
    </p>

    <h3>最终解释权归本公司所有</h3>
  </div>
</template>

<script>
import { Icon } from "vant";

export default {
  components: {
    vantIcon: Icon,
  },
  name: "Privacy",
};
</script>

<style scoped lang="less">
.privacy-shell {
  padding: 1.5rem 1rem 0;
  header {
    height: 40px;
    font-size: 25px;
    span {
      display: inline-block;
      width: 90%;
      text-align: center;
      line-height: 40px;
    }
  }
  h2 {
    text-align: center;
    font-size: 20px;
    font-weight: 700;
  }
  h3 {
    font-size: 18px;
  }
  h4 {
    font-size: 16px;
  }
  h5 {
    font-size: 14px;
  }
  p {
    text-indent: 2em;
  }
}
</style>