<template>
  <div class="serve-shell">
    <header>
      <router-link to="/setting">
        <vantIcon name="arrow-left" />
      </router-link>
      <span>服务协议</span>
    </header>
    <h2>本站服务协议</h2>

    <h3>【首部及导言】</h3>

    <p>欢迎您使用本站的服务！</p>

    <p>
      为使用本站的服务，您应当阅读并遵守《本站服务协议》（以下简称“本协议”）和《本站隐私政策》。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制本站责任的条款、对用户权利进行限制的条款、约定争议解决方式和司法管辖的条款（如第十八条相关约定）等，以及开通或使用某项服务的单独协议或规则。限制、免责条款或者其他涉及您重大权益的条款可能以加粗、加下划线等形式提示您重点注意。
      除非您已充分阅读、完全理解并接受本协议所有条款，否则您无权使用本站服务。您点击“同意”或“下一步”，或您使用本站服务，或者以其他任何明示或者默示方式表示接受本协议的，均视为您已阅读并同意签署本协议。本协议即在您与本站之间产生法律效力，成为对双方均具有约束力的法律文件。
      如果您因年龄、智力等因素而不具有完全民事行为能力，请在法定监护人（以下简称"监护人"）的陪同下阅读和判断是否同意本协议，并特别注意未成年人使用条款。
      如果您是中国大陆地区以外的用户，您订立或履行本协议还需要同时遵守您所属和/或所处国家或地区的法律。
    </p>

    <h3>一、【协议的范围】</h3>

    <p>
      1.1本协议是用户与本站之间关于其使用本站的服务所订立的协议。“本站”是指本站和/或其相关服务可能存在的运营关联单位。“用户”是指本站的服务的使用人，在本协议中更多地称为“您”。
    </p>

    <p>
      1.2本站的服务是指本站向用户提供的，包括但不限于即时通讯、网络媒体、互联网增值、互动娱乐、金融支付、广告等产品及服务，具体服务以本站实际提供的为准（以下简称“本服务”）。
    </p>

    <p>
      1.3本协议内容同时包括《本站隐私政策》（链接地址http://privacy.qq.com/）,且您在使用本站某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”）。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。您对前述任何单独协议的接受，即视为您对本协议全部的接受。您对本协议的接受，即视为您对《本站隐私政策》的接受。
    </p>

    <h3>二、【帐号与密码安全】</h3>

    <p>
      2.1您在使用本服务时可能需要注册一个帐号。关于您使用帐号的具体规则，请仔细阅读并遵守相关单独协议。
    </p>

    <p>
      2.2本站特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受被盗号或密码失窃，责任由您自行承担。
    </p>

    <p>
      2.3为增强用户体验和/或技术便利，本服务的帐号可能包括数字、字母或者其组合，以及手机号码、电子信箱等多种形式。在您注册某一形式的帐号时，本站可能附赠该帐号的另一表现形式。具体的帐号形式、帐号体系及帐号之间的关联关系等，以本站实际提供的为准。
    </p>

    <p>
      2.4您在使用本服务过程中，可能可以为您使用的帐号设置昵称、头像、签名、留言等信息，也可能为您建立或者管理、参与的QQ群、微信群等设置名称、图片、简介等信息。您应当保证这些信息的内容和形式符合法律法规（本协议中的“法律法规”指用户所属/所处地区、国家现行有效的法律、行政法规、司法解释、地方法规、地方规章、部门规章及其他规范性文件以及对于该等法律法规的不时修改和补充，以及相关政策规定等，下同。）、公序良俗、社会公德以及本站平台规则，且不会侵害任何主体的合法权益。
    </p>

    <p>
      2.5部分第三方网站或者服务可能可以用QQ帐号、微信帐号等作为其登录途径之一。您知晓，除非本站特别说明外，这些网站或者服务并非本站运营，您应自行判断此类第三方网站或者服务的安全性和可用性，并自行承担相关风险和责任。
    </p>

    <h3>三、【用户个人信息保护】</h3>

    <p>
      3.1保护用户个人信息是本站的一项基本原则。本站将按照本协议及《本站隐私政策》（链接地址：http://privacy.qq.com/）的规定收集、使用、储存和分享您的个人信息。本协议对个人信息保护相关内容未作明确规定的，均应以《本站隐私政策》的内容为准。
    </p>

    <p>
      3.2您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则可能无法使用本服务或在使用过程中受到限制。
    </p>

    <p>
      3.3一般情况下，您可根据相关产品规则浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
    </p>

    <p>
      3.4本站将尽可能运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。
    </p>

    <p>3.5本站不会将您的个人信息转移或披露给任何第三方，除非：</p>

    <p>（1）相关法律法规或司法机关、行政机关要求。</p>

    <p>（2）为完成合并、分立、收购或资产转让而转移。</p>

    <p>（3）为提供您要求的服务所必需。</p>

    <p>
      （4）依据《本站隐私政策》或其他相关协议规则可以转移或披露给任何第三方的情形。
    </p>

    <p>
      3.6本站非常重视对未成年人个人信息的保护。若您不具备完全民事行为能力，在使用本站的服务前，应事先取得您的监护人的同意。
    </p>

    <h3>四、【使用本服务的方式】</h3>

    <p>4.1本服务仅为您个人非商业性质的使用，除非您与本站另有约定。</p>

    <p>4.2您依本协议条款所取得的权利不可转让。</p>

    <p>
      4.3您不得使用任何方式（包括但不限于第三方软件、插件、外挂、系统、设备等）对本服务进行干扰、破坏、修改或施加其他影响。
    </p>

    <p>
      4.4您应当通过本站提供或认可的方式使用本服务，不得通过任何第三方软件、插件、外挂、系统、设备等登录或使用本服务。
    </p>

    <p>
      4.5任何人未经本站授权不得使用任何第三方软件、插件、外挂、系统等查看、获取本服务中所包含的本站、本站合作伙伴或用户的任何相关信息、数据等内容，同时，应当严格遵守本站发布的Robots协议等相关协议规则。
    </p>

    <h3>五、【按现状提供服务】</h3>

    <p>您理解并同意：</p>

    <p>
      5.1本服务是按照现有技术和条件所能达到的现状提供的。本站会尽最大努力保障服务的连贯性和安全性，但本站不能随时预见和防范法律、技术以及其他风险，本站对此类风险在法律允许的范围内免责，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。
    </p>

    <p>
      5.2因经营策略安排或调整等原因,不同地区的用户可使用的具体本站服务的内容可能会存在差异，具体以本站实际提供的为准。
    </p>
  </div>
</template>

<script>
import { Icon } from "vant";
export default {
  components: {
    vantIcon: Icon,
  },
  name: "Serve",
};
</script>

<style scoped lang="less">
.serve-shell{
  padding: 1.5rem 1rem 0;
  header {
  height: 40px;
  font-size: 25px;
  span {
    display: inline-block;
    width: 90%;
    text-align: center;
    line-height: 40px;
  }
}
h2 {
  text-align: center;
  font-size: 20px;
  font-weight: 700;
}
h3 {
  font-size: 18px;
}
p {
  text-indent: 2em;
}
}

</style>